{
  "name": "Сабина Боранбаева",
  "menu": {
    "en": "Английский",
    "ru": "Русский",
    "open": "Перейти на главную страницу",
    "about": "Обо мне",
    "skills": "Навыки",
    "contacts": "Контакты",
    "links": "Ссылки",
    "education": "Образование",
    "projects": "Мои проекты"
  },
  "aboutPage": {
    "text": "Добро пожаловать! Меня зовут Сабина. Мне 22 года. Всю свою жизнь, я никак не могла определиться с тем, чем бы я на самом деле хотела бы заниматься на постоянной основе. Однако, к 11-ому классу я всё таки решила пойти на факультет естественных наук и заняться Computer Science. Поэтому я поступила в Гронингенский университет в Голландии. Я сделала такой выбор, так как мне хотелось узнать об этой стране побольше. Мой университет находится в списке \"100 лучших университетов мира\". На Foundation году я встретила много интересных людей, которые стали мне друзьями. С ними я продолжаю общаться и по сей день.\nПоначалу учёба давалась нелегко, так как базовых знаний в школе я не получила. Однако, я не сдавалась, и, когда из 300 с чем-то человек нас осталось 100 с небольшим, я поняла, что всё было не зря. Я очень упёртый человек. Если у меня есть цель, то я к ней иду, не взирая ни на какие преграды. У меня также есть огромное терпение. Я тот человек, который может работать всю ночь за компьютером и не уставать. Особенно, если проект интересный. Я быстро разбираюсь в нужном мне материале, мне несложно научиться чему-то новому. За три года учёбы я развила в себе невероятные способности - легко находить необходимые мне документации по программированию.\nБлизкие мне люди называют меня светлым и весёлым человеком. Я очень оптимистична, и люблю, когда у людей развито чувство юмора. Ещё я являюсь командным игроком, мне нравится работать с другими людьми. Особенно, когда все работают сообща, т.е. помогают друг другу, отвечают за свои задачи, не предают доверие своих сокомандников. Также люблю креативность во всём, ищу различные способы облегчить решения сложных задач, как в жизни, так и в программировании. Спасибо, что дочитали до конца! Приятно с Вами познакомиться!"
  },
  "skillsPage": {
    "title1": "ЕСТЬ ОПЫТ В",
    "title2": "ЯЗЫКИ, С КОТОРЫМИ РАБОТАЛА В УНИВЕРСИТЕТЕ",
    "title3": "ДОПОЛНИТЕЛЬНЫЕ НАВЫКИ",
    "skill1": "Разбираюсь в Git",
    "skill2": "Работала с PostMan"
  },
  "educationPage": {
    "university": "Университет Гронингена, Гронинген, Нидерланды (бакалавр)",
    "year": "сентябрь 2017 - август 2020",
    "foundation": "Holland International Study Center, Гронинген, Нидерланды (foundation)",
    "years": "сентябрь 2016 - август 2017",
    "school": "Гимназия №40, Тараз, Казахстан"
  },
  "contactsPage": {
    "phone": "телефон"
  },
  "projectsPage": {
    "gallery": "Галерея",
    "infotb": "INFO-TB ПЛАТФОРМА",
    "infotb_img1": "Главная страница",
    "infotb_img2": "Её продолжение",
    "infotb_img3": "Страница, где можно задать вопрос эксперту:",
    "infotb_text": "Этот проект был сделан для курса Software Engineering в университете Гронингена. Это была командная работа. В моей команде было 6 человек: Alex Tutea, Tudor Hamdan, Richard Westerhof, Radu Catarambol, Merijn Schroder и я. Нашим ментором была Alina Matei. Первые двое человек были ответственны за Backend, остальные же, в том числе и я, занимались Frontend-ом. В общем у нас ушло 3 месяца на реализацию того, что хотела от нас клиентка, которая была Ph.D. студентом Медицинского университета в Гронингене. Мы использовали для работы Slack, чтобы обсуждать проект, и Trello, чтобы следить за процессом выполнения задач. Для Frontend-а мы использовали Vue.js, а для Backend-а - Express.js и node.js.",
    "ress_img1": "Карта",
    "ress_img2": "Рабочая страница для ресторанов",
    "ress_text": "Этот проект был создан для курса Requirements Engineering and Software Startups в университете Гронингена. Это была командная работа. В моей команде было 3 человека: Illarion Oralin, Richard Westerhof и я. Илларион работал на Backend частью, а Ричард и я занимались Frontend-ом. На этот проект у нас был один месяц. Мы использовали для работы Whatsapp, чтобы обсуждать проект, и Trello, чтобы следить за процессом выполнения задач. Для Frontend-а мы использовали Vue.js, а для Backend-а - Flask (Python framework).",
    "human_text": "Этот проект был создан для финального проекта на бакалавре. Я выполняла это одна, пользовалась фреймворком Apache Cordova (Phone Gap). Целью было создать мобильное приложение. Нет возможности закинуть фотографии проекта, однако могу показать на собеседовании.",
    "close": "закрыть"
  }
}